app/controllers/favorites_controller.rb

	def create
		@movie.favorites.create!(user: current_user)
---
INSERT INTO "favorites" ("movie_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["movie_id", 1], ["user_id", 1], ["created_at", 2017-03-08 20:14:35 UTC], ["updated_at", 2017-03-08 20:14:35 UTC]]

	def destroy
		favorite = current_user.favorites.find(params[:id])
		favorite.destroy
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]

	def set_movie
		@movie = Movie.find_by!(slug: params[:movie_id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."slug" = ? LIMIT ?  [["slug", "iron-man"], ["LIMIT", 1]]