app/controllers/movies_controller.rb

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."movie_id" = ? LIMIT ?  [["user_id", 1], ["movie_id", 1], ["LIMIT", 1]]
SELECT "genres".* FROM "genres" INNER JOIN "characterizations" ON "genres"."id" = "characterizations"."genre_id" WHERE "characterizations"."movie_id" = ?  [["movie_id", 1]]
---
  def show
    @fans = @movie.fans
    @genres = @movie.genres

    if current_user
     @current_fan = current_user.favorites.find_by(movie_id: @movie.id)

UPDATE "movies" SET "cast" = ?, "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["cast", ""], ["director", ""], ["updated_at", 2017-01-16 16:21:20 UTC], ["id", 7]]
---
  def update
    if @movie.update(movie_params)

INSERT INTO "movies" ("title", "rating", "total_gross", "created_at", "updated_at", "description", "released_on", "cast", "director", "duration", "image_file_name", "slug") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(movie_params)
    if @movie.save

SELECT  "movies".* FROM "movies" WHERE "movies"."slug" = ? LIMIT ?  [["slug", "iron-man"], ["LIMIT", 1]]
---
  def set_movie
    @movie = Movie.find_by!(slug: params[:id])