app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("name", "stars", "comment", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Roger Ebert"], ["stars", 3], ["comment", "I laughed, I cried, I spilled my popcorn!"], ["movie_id", 1], ["created_at", 2017-01-27 16:22:16 UTC], ["updated_at", 2017-01-27 16:22:16 UTC]]
---
	def create
		@review = @movie.reviews.new(review_params)
		if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "reviews" SET "name" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["name", "delete update"], ["updated_at", 2017-01-30 22:46:36 UTC], ["id", 6]]
---
	def update
		@review = Review.find(params[:id])
		if @review.update(review_params)