app/controllers/reviews_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."slug" = ? LIMIT ?  [["slug", "iron-man"], ["LIMIT", 1]]
---
	def set_movie
		@movie = Movie.find_by!(slug: params[:movie_id])